stm32-rs/stm32f4xx-hal/src/gpio/alt.rs
use super::{marker, Alternate, NoPin, OpenDrain, Pin, PinMode, PushPull};
use crate::{gpio, i2c, i2s, pac, serial, spi};

pub struct Const<const A: u8>;

pub trait SetAlternate<const A: u8, Otype> {
    fn set_alt_mode(&mut self);
    fn restore_mode(&mut self);
}
impl<Otype> SetAlternate<0, Otype> for NoPin {
    fn set_alt_mode(&mut self) {}
    fn restore_mode(&mut self) {}
}
impl<const P: char, const N: u8, MODE: PinMode + marker::NotAlt, const A: u8>
    SetAlternate<A, PushPull> for Pin<P, N, MODE>
{
    fn set_alt_mode(&mut self) {
        self.mode::<Alternate<A, PushPull>>();
    }

    fn restore_mode(&mut self) {
        self.mode::<MODE>();
    }
}

impl<const P: char, const N: u8, MODE: PinMode + marker::NotAlt, const A: u8>
    SetAlternate<A, OpenDrain> for Pin<P, N, MODE>
{
    fn set_alt_mode(&mut self) {
        self.mode::<Alternate<A, OpenDrain>>();
    }

    fn restore_mode(&mut self) {
        self.mode::<MODE>();
    }
}

impl<const P: char, const N: u8, const A: u8> SetAlternate<A, PushPull>
    for Pin<P, N, Alternate<A, PushPull>>
{
    fn set_alt_mode(&mut self) {}
    fn restore_mode(&mut self) {}
}

impl<const P: char, const N: u8, const A: u8> SetAlternate<A, OpenDrain>
    for Pin<P, N, Alternate<A, OpenDrain>>
{
    fn set_alt_mode(&mut self) {}
    fn restore_mode(&mut self) {}
}

pub trait PinA<PIN, PER> {
    type A;
}

impl<PIN, PER> PinA<PIN, PER> for NoPin
where
    PIN: crate::Sealed,
    PER: crate::Sealed,
{
    type A = Const<0>;
}

macro_rules! pin {
    ( $($name: ident, <$Pin:ty, $I2C:ident> for [$($PX:ident<$A:literal>),*]),*) => {
        $(
            $(
                impl<MODE> PinA<$Pin, pac::$I2C> for gpio::$PX<MODE> {
                    type A = Const<$A>;
                }
            )*
        )*
    };
}

// CAN pins

#[cfg(all(feature = "can", feature = "can1"))]
pub mod can1 {
    use super::*;
    use crate::can;

    pin! {
        Tx, <can::Tx, CAN1> for [PA12<9>, PD1<9>],
        Rx, <can::Rx, CAN1> for [PA11<9>, PD0<9>],
    }

    #[cfg(any(feature = "stm32f412", feature = "stm32f413", feature = "stm32f423"))]
    pin! {
        Tx, <can::Tx, CAN1> for [PB9<8>],
        Rx, <can::Rx, CAN1> for [PB8<8>]
    }

    #[cfg(any(
        feature = "stm32f405",
        feature = "stm32f407",
        feature = "stm32f415",
        feature = "stm32f417",
        feature = "stm32f427",
        feature = "stm32f429",
        feature = "stm32f437",
        feature = "stm32f439",
        feature = "stm32f446",
        feature = "stm32f469",
        feature = "stm32f479"
    ))]
    pin! {
        Tx, <can::Tx, CAN1> for [PB9<9>],
        Rx, <can::Rx, CAN1> for [PB8<9>]
    }

    #[cfg(any(feature = "stm32f412", feature = "stm32f413", feature = "stm32f423"))]
    pin! {
        Tx, <can::Tx, CAN1> for [PG1<9>],
        Rx, <can::Rx, CAN1> for [PG0<9>],
    }

    #[cfg(any(
        feature = "stm32f405",
        feature = "stm32f407",
        feature = "stm32f415",
        feature = "stm32f417",
        feature = "stm32f427",
        feature = "stm32f429",
        feature = "stm32f437",
        feature = "stm32f439",
        feature = "stm32f469",
        feature = "stm32f479"
    ))]
    pin! {
        Tx, <can::Tx, CAN1> for [PH13<9>],
        Rx, <can::Rx, CAN1> for [PI9<9>]
    }
}

#[cfg(all(feature = "can", feature = "can2"))]
pub mod can2 {
    use super::*;
    use crate::can;

    pin! {
        Tx, <can::Tx, CAN2> for [PB13<9>, PB6<9>],
        Rx, <can::Rx, CAN2> for [PB12<9>, PB5<9>]
    }

    #[cfg(any(feature = "stm32f412", feature = "stm32f413", feature = "stm32f423"))]
    pin! {
        Tx, <can::Tx, CAN2> for [PG12<9>],
        Rx, <can::Rx, CAN2> for [PG11<9>]
    }
}

#[cfg(all(feature = "can", feature = "can3"))]
pub mod can3 {
    use super::*;
    use crate::can;

    pin! {
        Tx, <can::Tx, CAN3> for [PA15<11>, PB4<11>],
        Rx, <can::Rx, CAN3> for [PA8<11>, PB3<11>]
    }
}

// I2C pins

pub mod i2c1 {
    use super::*;

    pin! {
        Scl, <i2c::Scl, I2C1> for [PB6<4>, PB8<4>],
        Sda, <i2c::Sda, I2C1> for [PB7<4>, PB9<4>]
    }
}

pub mod i2c2 {
    use super::*;

    #[cfg(any(feature = "stm32f446"))]
    pin! { Sda, <i2c::Sda, I2C2> for [PB3<4>] }

    #[cfg(any(
        feature = "stm32f401",
        feature = "stm32f410",
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423"
    ))]
    pin! { Sda, <i2c::Sda, I2C2> for [PB3<9>] }

    #[cfg(any(
        feature = "stm32f410",
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423"
    ))]
    pin! { Sda, <i2c::Sda, I2C2> for [PB9<9>] }

    pin! { Scl, <i2c::Scl, I2C2> for [PB10<4>] }

    #[cfg(any(
        feature = "stm32f405",
        feature = "stm32f407",
        feature = "stm32f410",
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f415",
        feature = "stm32f417",
        feature = "stm32f423",
        feature = "stm32f427",
        feature = "stm32f429",
        feature = "stm32f437",
        feature = "stm32f439",
        feature = "stm32f446",
        feature = "stm32f469",
        feature = "stm32f479"
    ))]
    pin! { Sda, <i2c::Sda, I2C2> for [PB11<4>] }

    #[cfg(any(feature = "stm32f446"))]
    pin! { Sda, <i2c::Sda, I2C2> for [PC12<4>] }

    #[cfg(any(
        feature = "stm32f405",
        feature = "stm32f407",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f415",
        feature = "stm32f417",
        feature = "stm32f423",
        feature = "stm32f427",
        feature = "stm32f429",
        feature = "stm32f437",
        feature = "stm32f439",
        feature = "stm32f446",
        feature = "stm32f469",
        feature = "stm32f479"
    ))]
    pin! {
        Scl, <i2c::Scl, I2C2> for [PF1<4>],
        Sda, <i2c::Sda, I2C2> for [PF0<4>]
    }

    #[cfg(any(
        feature = "stm32f405",
        feature = "stm32f407",
        feature = "stm32f415",
        feature = "stm32f417",
        feature = "stm32f427",
        feature = "stm32f429",
        feature = "stm32f437",
        feature = "stm32f439",
        feature = "stm32f469",
        feature = "stm32f479"
    ))]
    pin! {
        Scl, <i2c::Scl, I2C2> for [PH4<4>],
        Sda, <i2c::Sda, I2C2> for [PH5<4>]
    }
}

#[cfg(feature = "i2c3")]
pub mod i2c3 {
    use super::*;

    pin! {
        Scl, <i2c::Scl, I2C3> for [PA8<4>],
        Sda, <i2c::Sda, I2C3> for [PC9<4>]
    }

    #[cfg(feature = "stm32f446")]
    pin! { Sda, <i2c::Sda, I2C3> for [PB4<4>] }

    #[cfg(any(
        feature = "stm32f401",
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423"
    ))]
    pin! { Sda, <i2c::Sda, I2C3> for [PB4<9>] }

    #[cfg(any(
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423"
    ))]
    pin! { Sda, <i2c::Sda, I2C3> for [PB8<9>] }

    #[cfg(any(
        feature = "stm32f405",
        feature = "stm32f407",
        feature = "stm32f415",
        feature = "stm32f417",
        feature = "stm32f427",
        feature = "stm32f429",
        feature = "stm32f437",
        feature = "stm32f439",
        feature = "stm32f469",
        feature = "stm32f479"
    ))]
    pin! {
        Scl, <i2c::Scl, I2C3> for [PH7<4>],
        Sda, <i2c::Sda, I2C3> for [PH8<4>]
    }
}

#[cfg(feature = "fmpi2c1")]
pub mod fmpi2c1 {
    use super::*;
    pin! {
        Sda, <i2c::Sda, FMPI2C1> for [PB3<4>],
        Scl, <i2c::Scl, FMPI2C1> for [PB10<9>],
        Sda, <i2c::Sda, FMPI2C1> for [PB14<4>],
        Scl, <i2c::Scl, FMPI2C1> for [PB15<4>],
        Scl, <i2c::Scl, FMPI2C1> for [PC6<4>],
        Sda, <i2c::Sda, FMPI2C1> for [PC7<4>],
        Scl, <i2c::Scl, FMPI2C1> for [PD12<4>],
        Sda, <i2c::Sda, FMPI2C1> for [PD13<4>],
        Scl, <i2c::Scl, FMPI2C1> for [PD14<4>],
        Sda, <i2c::Sda, FMPI2C1> for [PD15<4>],
        Scl, <i2c::Scl, FMPI2C1> for [PF14<4>],
        Sda, <i2c::Sda, FMPI2C1> for [PF15<4>]
    }
}

// SPI pins

pub mod spi1 {
    use super::*;
    pin! {
        Sck, <spi::Sck,  SPI1> for [PA5<5>, PB3<5>],
        Miso, <spi::Miso, SPI1> for [PA6<5>, PB4<5>],
        Mosi, <spi::Mosi, SPI1> for [PA7<5>, PB5<5>]
    }
    #[cfg(any(
        feature = "stm32f410",
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423",
        feature = "stm32f446"
    ))]
    pin! {
        Nss, <spi::Nss,  SPI1> for [PA4<5>, PA15<5>]
    }
}

