stm32-rs/stm32f4xx-hal/src/gpio/alt.rs
pub mod spi2 {
    use super::*;
    pin! {
        Sck, <spi::Sck,  SPI2> for [PB10<5>, PB13<5>],
        Miso, <spi::Miso, SPI2> for [PB14<5>, PC2<5>],
        Mosi, <spi::Mosi, SPI2> for [PB15<5>, PC3<5>],
        Nss, <spi::Nss,  SPI2> for [PB9<5>, PB12<5>]
    }
    #[cfg(any(
        feature = "stm32f401",
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423",
        feature = "stm32f427",
        feature = "stm32f429",
        feature = "stm32f437",
        feature = "stm32f439",
        feature = "stm32f446",
        feature = "stm32f469",
        feature = "stm32f479"
    ))]
    pin! {
        Sck, <spi::Sck,  SPI2> for [PD3<5>]
    }
    #[cfg(any(
        feature = "stm32f405",
        feature = "stm32f407",
        feature = "stm32f415",
        feature = "stm32f417",
        feature = "stm32f427",
        feature = "stm32f429",
        feature = "stm32f437",
        feature = "stm32f439",
        feature = "stm32f469",
        feature = "stm32f479"
    ))]
    pin! {
        Sck, <spi::Sck,  SPI2> for [PI1<5>],
        Miso, <spi::Miso, SPI2> for [PI2<5>],
        Mosi, <spi::Mosi, SPI2> for [PI3<5>],
        Nss, <spi::Nss,  SPI2> for [PI0<5>]
    }

    #[cfg(any(
        feature = "stm32f410",
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423",
        feature = "stm32f446"
    ))]
    pin! {
        Sck, <spi::Sck, SPI2> for [PC7<5>]
    }

    #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
    pin! {
        Sck, <spi::Sck,  SPI2> for [PA9<5>],
        Miso, <spi::Miso, SPI2> for [PA12<5>],
        Mosi, <spi::Mosi, SPI2> for [PA10<5>],
        Nss, <spi::Nss,  SPI2> for [PA11<5>]
    }

    #[cfg(any(feature = "stm32f469", feature = "stm32f479"))]
    pin! {
        Sck, <spi::Sck,  SPI2> for [PA9<5>],
        Mosi, <spi::Mosi, SPI2> for [PC1<5>]
    }

    #[cfg(feature = "stm32f446")]
    pin! {
        Sck, <spi::Sck,  SPI2> for [PA9<5>],
        Mosi, <spi::Mosi, SPI2> for [PC1<7>],
        Nss, <spi::Nss,  SPI2> for [PB4<7>, PD1<7>]
    }
}

#[cfg(feature = "spi3")]
pub mod spi3 {
    use super::*;
    pin! {
        Sck, <spi::Sck,  SPI3> for [PB3<6>, PC10<6>],
        Miso, <spi::Miso, SPI3> for [PB4<6>, PC11<6>],
        Mosi, <spi::Mosi, SPI3> for [PB5<6>, PC12<6>],
        Nss, <spi::Nss,  SPI3> for [PA4<6>, PA15<6>]
    }
    #[cfg(any(
        feature = "stm32f401",
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423",
        feature = "stm32f427",
        feature = "stm32f429",
        feature = "stm32f437",
        feature = "stm32f439",
        feature = "stm32f446",
        feature = "stm32f469",
        feature = "stm32f479"
    ))]
    pin! {
        Mosi, <spi::Mosi, SPI3> for [PD6<5>]
    }

    #[cfg(any(
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423"
    ))]
    pin! {
        Sck, <spi::Sck,  SPI3> for [PB12<7>]
    }
    #[cfg(feature = "stm32f446")]
    pin! {
        Mosi, <spi::Mosi, SPI3> for [PB0<7>, PB2<7>, PC1<5>, PD0<6>]
    }
}

#[cfg(feature = "spi4")]
pub mod spi4 {
    use super::*;

    #[cfg(any(
        feature = "stm32f401",
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423",
        feature = "stm32f427",
        feature = "stm32f429",
        feature = "stm32f437",
        feature = "stm32f439",
        feature = "stm32f446",
        feature = "stm32f469",
        feature = "stm32f479"
    ))]
    pin! {
        Sck, <spi::Sck,  SPI4> for [PE2<5>, PE12<5>],
        Miso, <spi::Miso, SPI4> for [PE5<5>, PE13<5>],
        Mosi, <spi::Mosi, SPI4> for [PE6<5>, PE14<5>]
    }

    #[cfg(any(
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423"
    ))]
    pin! {
        Sck, <spi::Sck,  SPI4> for [PB13<6>],
        Miso, <spi::Miso, SPI4> for [PA11<6>],
        Mosi, <spi::Mosi, SPI4> for [PA1<5>],
        Nss, <spi::Nss,  SPI4> for [PB12<6>, PE4<5>, PE11<5>]
    }

    #[cfg(feature = "stm32f446")]
    pin! {
        Sck, <spi::Sck,  SPI4> for [PG11<6>],
        Miso, <spi::Miso, SPI4> for [PG12<6>, PD0<5>],
        Mosi, <spi::Mosi, SPI4> for [PG13<6>]
    }
}

#[cfg(feature = "spi5")]
pub mod spi5 {
    use super::*;

    #[cfg(any(
        feature = "stm32f410",
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423"
    ))]
    pin! {
        Sck, <spi::Sck,  SPI5> for [PB0<6>],
        Miso, <spi::Miso, SPI5> for [PA12<6>],
        Mosi, <spi::Mosi, SPI5> for [PA10<6>, PB8<6>],
        Nss, <spi::Nss,  SPI5> for [PB1<6>]
    }
    #[cfg(any(
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423"
    ))]
    pin! {
        Sck, <spi::Sck,  SPI5> for [PE2<6>, PE12<6>],
        Miso, <spi::Miso, SPI5> for [PE5<6>, PE13<6>],
        Mosi, <spi::Mosi, SPI5> for [PE6<6>, PE14<6>],
        Nss, <spi::Nss,  SPI5> for [PE4<6>, PE11<6>]
    }

    #[cfg(any(
        feature = "stm32f427",
        feature = "stm32f429",
        feature = "stm32f437",
        feature = "stm32f439",
        feature = "stm32f469",
        feature = "stm32f479"
    ))]
    pin! {
        Sck, <spi::Sck,  SPI5> for [PF7<5>, PH6<5>],
        Miso, <spi::Miso, SPI5> for [PF8<5>, PH7<5>],
        Mosi, <spi::Mosi, SPI5> for [PF9<5>, PF11<5>]
    }
}

#[cfg(feature = "spi6")]
pub mod spi6 {
    use super::*;

    #[cfg(any(
        feature = "stm32f427",
        feature = "stm32f429",
        feature = "stm32f437",
        feature = "stm32f439",
        feature = "stm32f469",
        feature = "stm32f479"
    ))]
    pin! {
        Sck, <spi::Sck,  SPI6> for [PG13<5>],
        Miso, <spi::Miso, SPI6> for [PG12<5>],
        Mosi, <spi::Mosi, SPI6> for [PG14<5>]
    }
}

