stm32-rs/stm32f4xx-hal/src/gpio/alt.rs
// SPI pins for I2S mode
pub mod i2s1 {
    use super::*;

    pin! {
        Ck, <i2s::Ck,  SPI1> for [PA5<5>, PB3<5>],
        Sd, <i2s::Sd, SPI1> for [PA7<5>, PB5<5>]
    }
    #[cfg(any(
        feature = "stm32f410",
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423",
        feature = "stm32f446"
    ))]
    pin! {
        Ws, <i2s::Ws,  SPI1> for [PA4<5>, PA15<5>]
    }

    #[cfg(any(
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423",
        feature = "stm32f446",
    ))]
    pin! { Mck, <i2s::Mck,  SPI1> for [PC4<5>] }

    #[cfg(feature = "stm32f410")]
    pin! { Mck, <i2s::Mck,  SPI1> for [PC7<6>, PB10<6>] }
}

pub mod i2s2 {
    use super::*;

    pin! {
        Ck, <i2s::Ck,  SPI2> for [PB10<5>, PB13<5>],
        Sd, <i2s::Sd, SPI2> for [PB15<5>, PC3<5>],
        Ws, <i2s::Ws,  SPI2> for [PB9<5>, PB12<5>],
        Mck, <i2s::Mck,  SPI2> for [PC6<5>]
    }

    #[cfg(any(
        feature = "stm32f401",
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423",
        feature = "stm32f427",
        feature = "stm32f429",
        feature = "stm32f437",
        feature = "stm32f439",
        feature = "stm32f446",
        feature = "stm32f469",
        feature = "stm32f479"
    ))]
    pin! {
        Ck, <i2s::Ck,  SPI2> for [PD3<5>]
    }

    #[cfg(any(
        feature = "stm32f405",
        feature = "stm32f407",
        feature = "stm32f415",
        feature = "stm32f417",
        feature = "stm32f427",
        feature = "stm32f429",
        feature = "stm32f437",
        feature = "stm32f439",
        feature = "stm32f469",
        feature = "stm32f479"
    ))]
    pin! {
        Ck, <i2s::Ck,  SPI2> for [PI1<5>],
        Sd, <i2s::Sd, SPI2> for [PI3<5>],
        Ws, <i2s::Ws,  SPI2> for [PI0<5>]
    }

    #[cfg(any(
        feature = "stm32f410",
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423",
        feature = "stm32f446"
    ))]
    pin! {
        Ck, <i2s::Ck, SPI2> for [PC7<5>]
    }

    #[cfg(any(
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423"
    ))]
    pin! {
        Mck, <i2s::Mck,  SPI2> for [PA3<5>, PA6<6>]
    }

    #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
    pin! {
        Ck, <i2s::Ck,  SPI2> for [PA9<5>],
        Sd, <i2s::Sd, SPI2> for [PA10<5>],
        Ws, <i2s::Ws,  SPI2> for [PA11<5>]
    }

    #[cfg(feature = "stm32f446")]
    pin! {
        Ck, <i2s::Ck,  SPI2> for [PA9<5>],
        Sd, <i2s::Sd, SPI2> for [PC1<7>],
        Ws, <i2s::Ws,  SPI2> for [PB4<7>, PD1<7>]
    }

    #[cfg(any(feature = "stm32f469", feature = "stm32f479"))]
    pin! {
        Ck, <i2s::Ck,  SPI2> for [PA9<5>],
        Sd, <i2s::Sd, SPI2> for [PC1<5>]
    }
}

#[cfg(feature = "spi3")]
pub mod i2s3 {
    use super::*;

    pin! {
        Ck, <i2s::Ck,  SPI3> for [PB3<6>, PC10<6>],
        Sd, <i2s::Sd, SPI3> for [PB5<6>, PC12<6>],
        Ws, <i2s::Ws,  SPI3> for [PA4<6>, PA15<6>],
        Mck, <i2s::Mck,  SPI3> for [PC7<6>]
    }

    #[cfg(any(
        feature = "stm32f401",
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423",
        feature = "stm32f427",
        feature = "stm32f429",
        feature = "stm32f437",
        feature = "stm32f439",
        feature = "stm32f446",
        feature = "stm32f469",
        feature = "stm32f479"
    ))]
    pin! {
        Sd, <i2s::Sd, SPI3> for [PD6<5>]
    }

    #[cfg(any(
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423"
    ))]
    pin! {
        Ck, <i2s::Ck,  SPI3> for [PB12<7>],
        Mck, <i2s::Mck,  SPI3> for [PB10<6>]
    }

    #[cfg(feature = "stm32f446")]
    pin! {
        Sd, <i2s::Sd, SPI3> for [PB0<7>, PB2<7>, PC1<5>, PD0<6>]
    }
}

#[cfg(feature = "spi4")]
pub mod i2s4 {
    use super::*;

    pin! {
        Ck, <i2s::Ck, SPI4> for [PE2<5>, PE12<5>],
        Sd, <i2s::Sd, SPI4> for [PE6<5>, PE14<5>]
    }

    #[cfg(any(
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423"
    ))]
    pin! {
        Ck, <i2s::Ck, SPI4> for [PB13<6>],
        Sd, <i2s::Sd, SPI4> for [PA1<5>],
        Ws, <i2s::Ws, SPI4> for [PB12<6>, PE4<5>, PE11<5>]
    }

    #[cfg(feature = "stm32f446")]
    pin! {
        Ck, <i2s::Ck, SPI4> for [PG11<6>],
        Sd, <i2s::Sd, SPI4> for [PG13<6>]
    }
}

#[cfg(feature = "spi5")]
pub mod i2s5 {
    use super::*;

    #[cfg(any(
        feature = "stm32f410",
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423"
    ))]
    pin! {
        Ck, <i2s::Ck, SPI5> for [PB0<6>],
        Sd, <i2s::Sd, SPI5> for [PA10<6>, PB8<6>],
        Ws, <i2s::Ws, SPI5> for [PB1<6>]
    }

    #[cfg(any(
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423"
    ))]
    pin! {
        Ck, <i2s::Ck, SPI5> for [PE2<6>, PE12<6>],
        Sd, <i2s::Sd, SPI5> for [PE6<6>, PE14<6>],
        Ws, <i2s::Ws, SPI5> for [PE4<6>, PE11<6>]
    }

    #[cfg(any(
        feature = "stm32f427",
        feature = "stm32f429",
        feature = "stm32f437",
        feature = "stm32f439",
        feature = "stm32f469",
        feature = "stm32f479"
    ))]
    pin! {
        Ck, <i2s::Ck, SPI5> for [PF7<5>, PH6<5>],
        Sd, <i2s::Sd, SPI5> for [PF9<5>, PF11<5>]
    }
}

#[cfg(feature = "spi6")]
pub mod i2s6 {
    use super::*;

    pin! {
        Ck, <i2s::Ck, SPI6> for [PG13<5>],
        Sd, <i2s::Sd, SPI6> for [PG14<5>]
    }
}

// Serial pins

pub mod usart1 {
    use super::*;

    pin! {
        Tx, <serial::TxPin, USART1> for [PA9<7>, PB6<7>],
        Rx, <serial::RxPin, USART1> for [PA10<7>, PB7<7>]
    }

    #[cfg(any(
        feature = "stm32f410",
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423"
    ))]
    pin! {
        Tx, <serial::TxPin, USART1> for [PA15<7>],
        Rx, <serial::RxPin, USART1> for [PB3<7>]
    }
}

pub mod usart2 {
    use super::*;

    pin! {
        Tx, <serial::TxPin, USART2> for [PA2<7>],
        Rx, <serial::RxPin, USART2> for [PA3<7>]
    }

    #[cfg(any(
        feature = "stm32f401",
        feature = "stm32f405",
        feature = "stm32f407",
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f415",
        feature = "stm32f417",
        feature = "stm32f423",
        feature = "stm32f427",
        feature = "stm32f429",
        feature = "stm32f437",
        feature = "stm32f439",
        feature = "stm32f446",
        feature = "stm32f469",
        feature = "stm32f479"
    ))]
    pin! {
        Tx, <serial::TxPin, USART2> for [PD5<7>],
        Rx, <serial::RxPin, USART2> for [PD6<7>]
    }
}

#[cfg(feature = "usart3")]
pub mod usart3 {
    use super::*;

    pin! {
        Tx, <serial::TxPin, USART3> for [PB10<7>],
        Rx, <serial::RxPin, USART3> for [PB11<7>]
    }

    #[cfg(any(
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423",
        feature = "stm32f446"
    ))]
    pin! {
        Rx, <serial::RxPin, USART3> for [PC5<7>]
    }

    #[cfg(any(
        feature = "stm32f405",
        feature = "stm32f407",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f415",
        feature = "stm32f417",
        feature = "stm32f423",
        feature = "stm32f427",
        feature = "stm32f429",
        feature = "stm32f437",
        feature = "stm32f439",
        feature = "stm32f446",
        feature = "stm32f469",
        feature = "stm32f479"
    ))]
    pin! {
        Tx, <serial::TxPin, USART3> for [PC10<7>],
        Rx, <serial::RxPin, USART3> for [PC11<7>]
    }

    #[cfg(any(
        feature = "stm32f405",
        feature = "stm32f407",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f415",
        feature = "stm32f417",
        feature = "stm32f423",
        feature = "stm32f427",
        feature = "stm32f429",
        feature = "stm32f437",
        feature = "stm32f439",
        feature = "stm32f446",
        feature = "stm32f469",
        feature = "stm32f479"
    ))]
    pin! {
        Tx, <serial::TxPin, USART3> for [PD8<7>],
        Rx, <serial::RxPin, USART3> for [PD9<7>]
    }
}

pub mod usart6 {
    use super::*;

    pin! {
        Tx, <serial::TxPin, USART6> for [PC6<8>],
        Rx, <serial::RxPin, USART6> for [PC7<8>]
    }

    #[cfg(any(
        feature = "stm32f401",
        feature = "stm32f410",
        feature = "stm32f411",
        feature = "stm32f412",
        feature = "stm32f413",
        feature = "stm32f423"
    ))]
    pin! {
        Tx, <serial::TxPin, USART6> for [PA11<8>],
        Rx, <serial::RxPin, USART6> for [PA12<8>]
    }

    #[cfg(feature = "gpiog")]
    pin! {
        Tx, <serial::TxPin, USART6> for [PG14<8>],
        Rx, <serial::RxPin, USART6> for [PG9<8>]
    }
}

#[cfg(feature = "uart4")]
pub mod uart4 {
    use super::*;

    pin! {
        Tx, <serial::TxPin, UART4> for [PA0<8>],
        Rx, <serial::RxPin, UART4> for [PA1<8>]
    }

    #[cfg(any(
        feature = "stm32f405",
        feature = "stm32f407",
        feature = "stm32f415",
        feature = "stm32f417",
        feature = "stm32f427",
        feature = "stm32f429",
        feature = "stm32f437",
        feature = "stm32f439",
        feature = "stm32f446",
        feature = "stm32f469",
        feature = "stm32f479"
    ))]
    pin! {
        Tx, <serial::TxPin, UART4> for [PC10<8>],
        Rx, <serial::RxPin, UART4> for [PC11<8>]
    }

    #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
    pin! {
        Tx, <serial::TxPin, UART4> for [PA12<11>, PD1<11>, PD10<8>],
        Rx, <serial::RxPin, UART4> for [PA11<11>, PD0<11>, PC11<8>]
    }
}

#[cfg(feature = "uart5")]
pub mod uart5 {
    use super::*;

    pin! {
        Tx, <serial::TxPin, UART5> for [PC12<8>],
        Rx, <serial::RxPin, UART5> for [PD2<8>]
    }

    #[cfg(feature = "stm32f446")]
    pin! {
        Tx, <serial::TxPin, UART5> for [PE8<8>],
        Rx, <serial::RxPin, UART5> for [PE7<8>]
    }

    #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
    pin! {
        Tx, <serial::TxPin, UART5> for [PB6<11>, PB9<11>, PB13<11>],
        Rx, <serial::RxPin, UART5> for [PB5<11>, PB8<11>, PB12<11>]
    }
}

#[cfg(feature = "uart7")]
pub mod uart7 {
    use super::*;

    #[cfg(feature = "gpioe")]
    pin! {
        Tx,<serial::TxPin, UART7> for [PE8<8>],
        Rx, <serial::RxPin, UART7> for [PE7<8>]
    }

    #[cfg(feature = "gpiof")]
    pin! {
        Tx, <serial::TxPin, UART7> for [PF7<8>],
        Rx, <serial::RxPin, UART7> for [PF6<8>]
    }

    #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
    pin! {
        Tx, <serial::TxPin, UART7> for [PA15<8>, PB4<8>],
        Rx, <serial::RxPin, UART7> for [PA8<8>, PB3<8>]
    }
}

#[cfg(feature = "uart8")]
pub mod uart8 {
    use super::*;

    #[cfg(feature = "gpioe")]
    pin! {
        Tx, <serial::TxPin, UART8> for [PE1<8>],
        Rx, <serial::RxPin, UART8> for [PE0<8>]
    }
    #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
    pin! {
        Tx, <serial::TxPin, UART8> for [PF9<8>],
        Rx, <serial::RxPin, UART8> for [PF8<8>]
    }
}

#[cfg(feature = "uart9")]
pub mod uart9 {
    use super::*;

    #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
    pin! {
        Tx, <serial::TxPin, UART9> for [PD15<11>, PG1<11>],
        Rx, <serial::RxPin, UART9> for [PD14<11>, PG0<11>]
    }
}

#[cfg(feature = "uart10")]
pub mod uart10 {
    use super::*;

    #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
    pin! {
        Tx, <serial::TxPin, UART10> for [PE3<11>, PG12<11>],
        Rx, <serial::RxPin, UART10> for [PE2<11>, PG11<11>]
    }
}